#!/bin/sh

# 売掛金明細表と買掛金明細表を生成するやつ
# Usage: $0 [--render] 前の明細表ファイル 新たな仕訳表ファイル

set -eu;umask 0022;export LC_ALL=C
if posixpath="$(command -p getconf PATH 2>/dev/null)"; then
	export PATH="$posixpath${PATH+:}${PATH:-}"
fi
export POSIXLY_CORRECT=1 UNIX_STD=2003

opt_render=0
case "$1" in --render) opt_render=1; shift;; esac

(
###########################################################################
# 明細表の処理をする
###########################################################################

    # 前の明細表くれ
    cat "$1" |
    #
    # 各会社に番号を付けようか
    awk '$0 = NR FS $0'

###########################################################################
# 仕訳表から売掛金のやつと買掛金のやつをどうにかする
###########################################################################

    # 仕訳表(といっても合計試算表あるかも)くれ
    cat "$2" |
    #
    # 仕訳表だけくれ
    awk -v mode=1 '
        $1 == "__HEAD__" { mode = 0; }
        $1 == "__BODY__" { mode = 1; }
        mode;
    ' |
    #
    # 正しい書式のものだけくれ
    awk 'NF == 3 && ($1 == "<" || $1 == ">")' |
    #
    # 売掛金と買掛金だけくれ
    grep -F -e '売掛金@' -e '買掛金@' |
    #
    # あと取引相手だけでよくね
    sed 's/売掛金@//; s/買掛金@//' |
    #
    # 仮の番号をつけておくか
    awk '$0 = "*" FS $0'
) |
#
# 4列
# 社名番号または"_"、借方か貸方かどちらかの記号、社名、金額
# コンマなくしとくか(金額の)
tr -d , |
#
# 4列
# 仮の番号をなくして本当の番号を付けようか
awk '
    $1 != "*" { compName[$3] = $1; }
    $1 == "*" { $1 = compName[$3]; }
    $1 == "" {
        # なんか知らん社名ある
        print "WARNING: " $3 ": unknown company name" | "cat 1>&2";
    }
    1;
' |
#
# 4列
# 借方(売掛金)を正としとくか
# つまり貸方(買掛金)を負とする
awk '$2 == ">" { $4 *= -1; }; 1' |
#
# 4列
# 合計得よう
sort -nk1 |
sm2 3 3 4 4 |
#
# 2列
# 社名、借方としての金額
# "<>"を復活しとくか
awk '
    $2 > 0 { print "<", $1, $2; }
    $2 < 0 { print ">", $1, -$2; }
' |
case "$opt_render" in 0) cat; exit;; *)
    #
    # 3列
    # 借方か貸方か、社名、売掛金または買掛金
    # 各掛金の合計出そうか
    sm4 1 1 2 2 3 3 |
    #
    # きれいに表示しとこうか
    comma 3 | keta
;;esac
